// змінна яка постійно оновлюється і зберігає час

const pt1 = document.querySelector(".pt1");
const pt2 = document.querySelector(".pt2");
const pt3 = document.querySelector(".pt3");

setTimeout(() => {
  pt1.textContent = "Пройшло 2 секунди"
}, 2000);

setInterval(() => {
  time = new Date();
  pt2.textContent = `${time.getHours()}.${time.getMinutes()}.${time.getSeconds()}`;
}, 1000);

// let i = 0;
// const st1 = setInterval(() => {
//     i++;
//     if (i <= 10) {
//       pt3.textContent = `${time.getSeconds()}`;
//     } else {
//         clearInterval(st1);
//       }
//   }, 1000);

// time = new Date();


// Завдання 3: Зупинка інтервалу
// Напишіть програму, яка через кожні 3 секунди виводить в консоль повідомлення, але після 10 секунд припиняє виконання цього інтервалу.

// Завдання 4: Таймер з динамічним зупиненням
// Створіть програму, яка за допомогою setTimeout виводить повідомлення "Таймер завершений!", але дозволяє користувачеві через 2 секунди зупинити таймер вручну, натиснувши кнопку "Скасувати".

// Завдання 5: Лічильник з таймером
// Створіть програму, яка запускає лічильник, який збільшується на 1 кожну секунду. Лічильник повинен зупинятися після 10 секунд.